New mermaid skill
